app/views/memberships/index.html.erb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ?  [["user_id", 3]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---

          <% current_user.memberships.each do |membership| %>
      <tr>
        <td><%= Group.find(membership.group_id).group_name %></td>
        <td><%= User.find(membership.user_id).name %></td>