app/views/memberships/new.html.erb

SELECT "users".* FROM "users"
---

          <%= select_tag(:user_id, options_from_collection_for_select(User.all,:id,:name), :class => "form-control") %>

SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---

      <% Membership.where(:group_id => @group.id).each do |member| %>
      <li><%= User.find(member.user_id).name %> (<%= User.find(member.user_id).email %>)</li>