app/views/groups/index.html.erb


      <% current_user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 3]]

        <td><a href="/groups/<%= group.id %>/edit" ><%= group.group_name %></td>
        <td><%= User.find(group.user_id).name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]