app/views/groups/show.html.erb

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ? LIMIT 1  [["group_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---

      <% Membership.where(:group_id => @group.id).each do |member| %>
      <tr>
        <td><%= User.find(member.user_id).name %> </td>

SELECT "expenses".* FROM "expenses" WHERE "expenses"."group_id" = ?  [["group_id", 4]]
---
<% h={} %>
<% @group.expenses.group_by(&:category).map{|k,v|h[k] = v.map(&:value).sum} %>

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."group_id" = ? AND "expenses"."user_id" = ?  [["group_id", 4], ["user_id", 4]]
---
<% h={} %>
<% @group.expenses.where(:user_id=> member.user_id).group_by(&:category).map{|k,v|h[k] = v.map(&:value).sum} %>