app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses"
---
  def index
    @expenses = Expense.all

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @expense = Expense.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 4]]
---
 def group_expenses
    @group = Group.find(params[:id])

INSERT INTO "expenses" ("paid_form", "expense_type", "held_on", "category", "value", "expense_name", "group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @expense = Expense.new
    @expense.paid_form = params[:paid_form]
    @expense.expense_type = params[:expense_type]
    @expense.held_on = params[:held_on]
    @expense.category = params[:category]
    @expense.value = params[:value]
    @expense.expense_name = params[:expense_name]
    @expense.group_id = params[:group_id]
    @expense.user_id = params[:user_id]

    if @expense.save

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @expense = Expense.find(params[:id])

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "expenses" SET "held_on" = ?, "value" = ?, "group_id" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["held_on", "2015-11-16"], ["value", 100.0], ["group_id", 4], ["updated_at", "2015-11-30 21:03:34.356567"], ["id", 13]]
---
  def update
    @expense = Expense.find(params[:id])

    @expense.paid_form = params[:paid_form]
    @expense.expense_type = params[:expense_type]
    @expense.held_on = params[:held_on]
    @expense.category = params[:category]
    @expense.value = params[:value]
    @expense.expense_name = params[:expense_name]
    @expense.group_id = params[:group_id]
    @expense.user_id = params[:user_id]

  if @expense.save

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 1]]
---
  def destroy
    @expense = Expense.find(params[:id])

    @expense.destroy