app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."group_name" = ? LIMIT 1  [["group_name", "adasfasf"]]
INSERT INTO "groups" ("group_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_name", "rrrr"], ["user_id", 0], ["created_at", "2015-11-25 17:49:49.073299"], ["updated_at", "2015-11-25 17:49:49.073299"]]
INSERT INTO "memberships" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 23], ["user_id", 3], ["created_at", "2015-11-26 16:12:04.296529"], ["updated_at", "2015-11-26 16:12:04.296529"]]
---
  def create
    @group = Group.new
    @group.group_name = params[:group_name]
    @group.user_id = params[:user_id]
    @group.save

    @membership = Membership.new
    @membership.group_id = Group.find_by(:group_name => @group.group_name).id
    @membership.user_id = params[:user_id]
    @membership.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "groups" SET "group_name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["group_name", "Soccer"], ["updated_at", "2015-11-26 16:36:57.005488"], ["id", 3]]
---
  def update
    @group = Group.find(params[:id])

    @group.group_name = params[:group_name]
    @group.user_id = params[:user_id]

    if @group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
---
  def destroy
    @group = Group.find(params[:id])

    @group.destroy