app/controllers/memberships_controller.rb

  def index
    @memberships = Membership.all
---
SELECT "memberships".* FROM "memberships"

  def new
    @membership = Membership.new
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @group = Group.find(params[:group_id])

    @membership = Membership.new
    @membership.group_id = params[:group_id]
    @membership.user_id = params[:user_id]

    if @membership.save
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", nil]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 23]]
INSERT INTO "memberships" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 0], ["user_id", 0], ["created_at", "2015-11-25 23:45:02.381822"], ["updated_at", "2015-11-25 23:45:02.381822"]]

def remove
  @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]

  def destroy
    @membership = Membership.find_by(:group_id => params[:group], :user_id => params[:user])

    @membership.destroy
---
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ? AND "memberships"."user_id" = ? LIMIT 1  [["group_id", 3], ["user_id", 4]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 1]]