app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "ramiro@chicagobooth.edu"], ["name", "Ramiro"], ["created_at", "2015-11-24 03:56:05.451703"], ["updated_at", "2015-11-24 03:56:05.451703"]]
---
  def create
    @user = User.new
    @user.bank_account = params[:bank_account]
    @user.email = params[:email]
    @user.name = params[:name]

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Ramiro Sanchez Caballero"], ["updated_at", "2015-11-24 03:57:03.640110"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])

    @user.bank_account = params[:bank_account]
    @user.email = params[:email]
    @user.name = params[:name]

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user = User.find(params[:id])

    @user.destroy