app/views/expenses/edit.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 3]]
---

        <%= select_tag(:group_id, options_from_collection_for_select(current_user.groups,:id,:group_name, @expense.group_id), :class => "form-control") %>