app/views/expenses/group_expenses.html.erb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."group_id" = ?  [["group_id", 4]]
---

      <% @group.expenses.each do |expense| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
        <td><%= expense.value %></td>
        <td><%= User.find(expense.user_id).name %></td>