app/views/expenses/index.html.erb


      <% current_user.expenses.each do |expense| %>
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ?  [["user_id", 3]]

        <td>
      <% if  Group.find(expense.group_id).nil? %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 4]]