app/views/expenses/new.html.erb


        <%= select_tag(:group_id, options_from_collection_for_select(current_user.groups,:id,:group_name, @expense.group_id), :class => "form-control") %>
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 3]]